Repository: eduNEXT/xblock-completion-grading
Catalog: completion_grading/locale/rtl/LC_MESSAGES/text.po
Languages: rtl

source: Display Name
rtl: Đᴉsdlɐʎ Nɐɯǝ

source: The display name for this component.
rtl: Ŧɥǝ dᴉsdlɐʎ nɐɯǝ ɟøɹ ʇɥᴉs ɔøɯdønǝnʇ.

source: Course Completion Grading
rtl: Ȼønɹsǝ Ȼøɯdlǝʇᴉøn Ǥɹɐdᴉnƃ

source: Grading Method
rtl: Ǥɹɐdᴉnƃ Mǝʇɥød

source: Completion grading method for the component. There are two options: minimum completion and average completion. Minimum completion grades learners based on the minimum number of completed units, if the learner has completed the minimum number of units, they will get a grade of 1, otherwise 0. Average completion grades learners based on the average number of completed units, if the learner has completed a number of units greater or equal to the number of completed units required to get a grade, they will get a grade of 1, otherwise the grade will be the number of completed units divided by the number of completed units required to get a grade configured in the component.If the value is not set, the component will use the minimum completion method.The unit completions don't include the completion of the unit that contains the component.
rtl: Ȼøɯdlǝʇᴉøn ƃɹɐdᴉnƃ ɯǝʇɥød ɟøɹ ʇɥǝ ɔøɯdønǝnʇ. Ŧɥǝɹǝ ɐɹǝ ʇʍø ødʇᴉøns: ɯᴉnᴉɯnɯ ɔøɯdlǝʇᴉøn ɐnd ɐʌǝɹɐƃǝ ɔøɯdlǝʇᴉøn. Mᴉnᴉɯnɯ ɔøɯdlǝʇᴉøn ƃɹɐdǝs lǝɐɹnǝɹs bɐsǝd øn ʇɥǝ ɯᴉnᴉɯnɯ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs, ᴉɟ ʇɥǝ lǝɐɹnǝɹ ɥɐs ɔøɯdlǝʇǝd ʇɥǝ ɯᴉnᴉɯnɯ nnɯbǝɹ øɟ nnᴉʇs, ʇɥǝʎ ʍᴉll ƃǝʇ ɐ ƃɹɐdǝ øɟ 1, øʇɥǝɹʍᴉsǝ 0. Ⱥʌǝɹɐƃǝ ɔøɯdlǝʇᴉøn ƃɹɐdǝs lǝɐɹnǝɹs bɐsǝd øn ʇɥǝ ɐʌǝɹɐƃǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs, ᴉɟ ʇɥǝ lǝɐɹnǝɹ ɥɐs ɔøɯdlǝʇǝd ɐ nnɯbǝɹ øɟ nnᴉʇs ƃɹǝɐʇǝɹ øɹ ǝbnɐl ʇø ʇɥǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs ɹǝbnᴉɹǝd ʇø ƃǝʇ ɐ ƃɹɐdǝ, ʇɥǝʎ ʍᴉll ƃǝʇ ɐ ƃɹɐdǝ øɟ 1, øʇɥǝɹʍᴉsǝ ʇɥǝ ƃɹɐdǝ ʍᴉll bǝ ʇɥǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs dᴉʌᴉdǝd bʎ ʇɥǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs ɹǝbnᴉɹǝd ʇø ƃǝʇ ɐ ƃɹɐdǝ ɔønɟᴉƃnɹǝd ᴉn ʇɥǝ ɔøɯdønǝnʇ.Ɨɟ ʇɥǝ ʌɐlnǝ ᴉs nøʇ sǝʇ, ʇɥǝ ɔøɯdønǝnʇ ʍᴉll nsǝ ʇɥǝ ɯᴉnᴉɯnɯ ɔøɯdlǝʇᴉøn ɯǝʇɥød.Ŧɥǝ nnᴉʇ ɔøɯdlǝʇᴉøns døn'ʇ ᴉnɔlndǝ ʇɥǝ ɔøɯdlǝʇᴉøn øɟ ʇɥǝ nnᴉʇ ʇɥɐʇ ɔønʇɐᴉns ʇɥǝ ɔøɯdønǝnʇ.

source: Maximum Attempts
rtl: Mɐxᴉɯnɯ Ⱥʇʇǝɯdʇs

source: Defines the number of times a student can attempt to calculate the grade. If the value is not set, infinite attempts are allowed.
rtl: Đǝɟᴉnǝs ʇɥǝ nnɯbǝɹ øɟ ʇᴉɯǝs ɐ sʇndǝnʇ ɔɐn ɐʇʇǝɯdʇ ʇø ɔɐlɔnlɐʇǝ ʇɥǝ ƃɹɐdǝ. Ɨɟ ʇɥǝ ʌɐlnǝ ᴉs nøʇ sǝʇ, ᴉnɟᴉnᴉʇǝ ɐʇʇǝɯdʇs ɐɹǝ ɐlløʍǝd.

source: Number of completed units
rtl: Nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs

source: Number of units that need to be completed to get a grade.
rtl: Nnɯbǝɹ øɟ nnᴉʇs ʇɥɐʇ nǝǝd ʇø bǝ ɔøɯdlǝʇǝd ʇø ƃǝʇ ɐ ƃɹɐdǝ.

source: Problem Weight
rtl: Ᵽɹøblǝɯ Wǝᴉƃɥʇ

source: Defines the number of points this problem is worth. If the value is not set, the problem is worth 1 point.
rtl: Đǝɟᴉnǝs ʇɥǝ nnɯbǝɹ øɟ døᴉnʇs ʇɥᴉs dɹøblǝɯ ᴉs ʍøɹʇɥ. Ɨɟ ʇɥǝ ʌɐlnǝ ᴉs nøʇ sǝʇ, ʇɥǝ dɹøblǝɯ ᴉs ʍøɹʇɥ 1 døᴉnʇ.

source: Instructions Text
rtl: Ɨnsʇɹnɔʇᴉøns Ŧǝxʇ

source: Instructions to be displayed to the student.
rtl: Ɨnsʇɹnɔʇᴉøns ʇø bǝ dᴉsdlɐʎǝd ʇø ʇɥǝ sʇndǝnʇ.

source: Please press the button to calculate your grade according to the number of completed units in the course.
rtl: Ᵽlǝɐsǝ dɹǝss ʇɥǝ bnʇʇøn ʇø ɔɐlɔnlɐʇǝ ʎønɹ ƃɹɐdǝ ɐɔɔøɹdᴉnƃ ʇø ʇɥǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs ᴉn ʇɥǝ ɔønɹsǝ.

source: Button Text
rtl: Ƀnʇʇøn Ŧǝxʇ

source: Text to be displayed on the button.
rtl: Ŧǝxʇ ʇø bǝ dᴉsdlɐʎǝd øn ʇɥǝ bnʇʇøn.

source: Calculate Grade
rtl: Ȼɐlɔnlɐʇǝ Ǥɹɐdǝ

source: Number of attempts taken by the student to calculate the grade.
rtl: Nnɯbǝɹ øɟ ɐʇʇǝɯdʇs ʇɐʞǝn bʎ ʇɥǝ sʇndǝnʇ ʇø ɔɐlɔnlɐʇǝ ʇɥǝ ƃɹɐdǝ.

source: Raw score
rtl: Ɍɐʍ sɔøɹǝ

source: The raw score for the assignment.
rtl: Ŧɥǝ ɹɐʍ sɔøɹǝ ɟøɹ ʇɥǝ ɐssᴉƃnɯǝnʇ.

source: Submission UUID
rtl: Snbɯᴉssᴉøn ɄɄƗĐ

source: The submission UUID for the assignment.
rtl: Ŧɥǝ snbɯᴉssᴉøn ɄɄƗĐ ɟøɹ ʇɥǝ ɐssᴉƃnɯǝnʇ.

source: You have reached the maximum number of attempts.
rtl: Ɏøn ɥɐʌǝ ɹǝɐɔɥǝd ʇɥǝ ɯɐxᴉɯnɯ nnɯbǝɹ øɟ ɐʇʇǝɯdʇs.

source: Grade calculated successfully.
rtl: Ǥɹɐdǝ ɔɐlɔnlɐʇǝd snɔɔǝssɟnllʎ.

source: Dummy
rtl: Đnɯɯʎ

source: You have made
rtl: Ɏøn ɥɐʌǝ ɯɐdǝ

source: attempts to calculate the grading.
rtl: ɐʇʇǝɯdʇs ʇø ɔɐlɔnlɐʇǝ ʇɥǝ ƃɹɐdᴉnƃ.

source: Your score is:
rtl: Ɏønɹ sɔøɹǝ ᴉs:

source: Minimum number of completed units
rtl: Mᴉnᴉɯnɯ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs

source: Average Number of Completed Units
rtl: Ⱥʌǝɹɐƃǝ nnɯbǝɹ øɟ ɔøɯdlǝʇǝd nnᴉʇs
