Repository: eduNEXT/xblock-completion-grading
Catalog: completion_grading/locale/*/LC_MESSAGES/text.po
Languages: eo, es_es

source: Display Name
eo: Dïspläý Nämé Ⱡ'σяєм ιρѕυм ∂σłσя ѕ#
es_es: Nombre a Mostrar

source: The display name for this component.
eo: Thé dïspläý nämé för thïs çömpönént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυ#
es_es: El nombre para mostrar de este componente.

source: Course Completion Grading
eo: Çöürsé Çömplétïön Grädïng Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#
es_es: Calificación por Nivel de Finalización del Curso

source: Grading Method
eo: Grädïng Méthöd Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
es_es: Método de Calificación

source: Completion grading method for the component. There are two options: minimum completion and weighted completion. Minimum completion grades learners based on the minimum number of completed units, if the learner has completed the minimum number of units, they will get a grade of 1, otherwise 0. Weighted completion grades learners based on the weighted number of completed units, if the learner has completed a number of units greater or equal to the number of completed units required to get a grade, they will get a grade of 1, otherwise the grade will be the number of completed units divided by the number of completed units required to get a grade configured in the component.If the value is not set, the component will use the minimum completion method.The unit completions don't include the completion of the unit that contains the component.
es_es: Método de calificación para el componente. Hay dos opciones: finalización mínima y finalización media. La finalización mínima califica a los estudiantes en función al número mínimo de unidades completadas, si el alumno ha completado el número mínimo de unidades, obtendrá una calificación de 1; en caso contrario, 0. La finalización media califica a los estudiantes en función del número medio de unidades completadas; si el alumno ha completado un número de unidades superior o igual al número de unidades completadas necesario para obtener una calificación, obtendrá una calificación de 1; en caso contrario, la calificación será el número de unidades completadas dividido por el número de unidades completadas necesario para obtener una calificación configurada en el componente. Si el valor no está configurado, el componente utilizará el método de finalización mínima. Las unidades completadas no incluyen la finalización de la unidad que contiene el componente.

source: Maximum Attempts
eo: Mäxïmüm Àttémpts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αм#
es_es: Número Máximo de Intentos

source: Defines the number of times a student can attempt to calculate the grade. If the value is not set, infinite attempts are allowed.
eo: Défïnés thé nümßér öf tïmés ä stüdént çän ättémpt tö çälçüläté thé grädé. Ìf thé välüé ïs nöt sét, ïnfïnïté ättémpts äré ällöwéd. Ⱡ'σ#
es_es: Define el número de veces que un estudiante puede intentar calcular la calificación. Si el valor no está establecido, se permiten intentos indefinidos.

source: Number of Completed Units
es_es: Número de Unidades Completadas

source: Number of units that need to be completed to get a grade.
eo: Nümßér öf ünïts thät nééd tö ßé çömplétéd tö gét ä grädé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
es_es: Número de unidades que deben completarse para obtener una calificación.

source: Problem Weight
eo: Prößlém Wéïght Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
es_es: Peso del Problema

source: Defines the number of points this problem is worth. If the value is not set, the problem is worth 10 points.
es_es: Define el número de puntos que vale este problema. Si el valor no está establecido, el problema vale 10 puntos.

source: Instructions Text
eo: Ìnstrüçtïöns Téxt Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмє#
es_es: Texto de las Instrucciones

source: Instructions to be displayed to the student.
eo: Ìnstrüçtïöns tö ßé dïspläýéd tö thé stüdént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
es_es: Define el texto de las instrucciones que se mostrará al estudiante.

source: Please press the button to calculate your grade according to the number of completed units in the course.
eo: Pléäsé préss thé ßüttön tö çälçüläté ýöür grädé äççördïng tö thé nümßér öf çömplétéd ünïts ïn thé çöürsé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт #
es_es: Por favor, presiona el botón para calcular su nota según el número de unidades completadas en el curso.

source: Button Text
eo: Büttön Téxt Ⱡ'σяєм ιρѕυм ∂σłσя #
es_es: Texto del Botón

source: Text to be displayed on the button.
eo: Téxt tö ßé dïspläýéd ön thé ßüttön. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєт#
es_es: Define el texto que se mostrará en el botón.

source: Calculate Grade
eo: Çälçüläté Grädé Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт α#
es_es: Calcular Calificación

source: Number of attempts taken by the student to calculate the grade.
eo: Nümßér öf ättémpts täkén ßý thé stüdént tö çälçüläté thé grädé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
es_es: Número de intentos tomados por el estudiante para calcular la calificación.

source: Raw score
eo: Räw sçöré Ⱡ'σяєм ιρѕυм ∂σł#
es_es: Puntuación Bruta

source: The raw score for the assignment.
eo: Thé räw sçöré för thé ässïgnmént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тє#
es_es: La puntuación bruta para la tarea.

source: Submission UUID
eo: Süßmïssïön ÛÛÌD Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт α#
es_es: UUID de la Entrega

source: The submission UUID for the assignment.
eo: Thé süßmïssïön ÛÛÌD för thé ässïgnmént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя#
es_es: El UUID de la entrega para la tarea.

source: Task ID
es_es: ID de la tarea asíncrona

source: The task ID for the unit completions calculation task.
es_es: El ID de tarea para la tarea de cálculo de unidades completadas.

source: You have reached the maximum number of attempts.
eo: Ýöü hävé réäçhéd thé mäxïmüm nümßér öf ättémpts. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
es_es: Has alcanzado el número máximo de intentos.

source: Grade calculations for your latest completion state are in progress. Try again in a few seconds.
es_es: Los cálculos de calificaciones para tu último estado de finalización están en progreso. Inténtalo de nuevo en unos segundos.

source: Completion grade calculation failed. Try again later.
es_es: Error en el cálculo de la calificación de finalización. Vuelva a intentarlo más tarde.

source: You have made
eo: Ýöü hävé mädé Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
es_es: Has hecho

source: attempts to calculate the grading.
eo: ättémpts tö çälçüläté thé grädïng. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєт#
es_es: intentos para calcular la calificación.

source: Your score is:
eo: Ýöür sçöré ïs: Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
es_es: Tu puntuación es:

source: Minimum Number of Completed Units
eo: Mïnïmüm nümßér öf çömplétéd ünïts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тє#
es_es: Número Mínimo de Unidades Completadas

source: Weighted Number of Completed Units
eo: Àvérägé nümßér öf çömplétéd ünïts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тє#
es_es: Número Ponderado de Unidades Terminadas

source: Completion grading method for the component. There are two options: minimum completion and weighted completion. Minimum completion grades learners based on the minimum number of completed units, if the learner has completed the minimum number of units, they will get a grade of 1, otherwise 0. Weighted completion grades learners based on the weighted number of completed units, if the learner has completed a number of units greater or equal to the number of completed units required to get a grade, they will get a grade of 1, otherwise the grade will be the number of completed units divided by the number of completed units required to get a grade configured in the component. If the value is not set, the component will use the minimum completion method.The unit completions don't include the completion of the unit that contains the component.
eo: Çömplétïön grädïng méthöd för thé çömpönént. Théré äré twö öptïöns: mïnïmüm çömplétïön änd ävérägé çömplétïön. Mïnïmüm çömplétïön grädés léärnérs ßäséd ön thé mïnïmüm nümßér öf çömplétéd ünïts, ïf thé léärnér häs çömplétéd thé mïnïmüm nümßér öf ünïts, théý wïll gét ä grädé öf 1, öthérwïsé 0. Àvérägé çömplétïön grädés léärnérs ßäséd ön thé ävérägé nümßér öf çömplétéd ünïts, ïf thé léärnér häs çömplétéd ä nümßér öf ünïts gréätér ör éqüäl tö thé nümßér öf çömplétéd ünïts réqüïréd tö gét ä grädé, théý wïll gét ä grädé öf 1, öthérwïsé thé grädé wïll ßé thé nümßér öf çömplétéd ünïts dïvïdéd ßý thé nümßér öf çömplétéd ünïts réqüïréd tö gét ä grädé çönfïgüréd ïn thé çömpönént.Ìf thé välüé ïs nöt sét, thé çömpönént wïll üsé thé mïnïmüm çömplétïön méthöd.Thé ünït çömplétïöns dön't ïnçlüdé thé çömplétïön öf thé ünït thät çöntäïns thé çömpönént.#

source: Number of completed units
eo: Nümßér öf çömplétéd ünïts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#

source: Defines the number of points this problem is worth. If the value is not set, the problem is worth 1 point.
eo: Défïnés thé nümßér öf pöïnts thïs prößlém ïs wörth. Ìf thé välüé ïs nöt sét, thé prößlém ïs wörth 1 pöïnt. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт #

source: Grade calculated successfully.
eo: Grädé çälçülätéd süççéssfüllý. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢т#

source: Dummy
eo: Dümmý Ⱡ'σяєм ιρѕ#
